

//type frozen,lou
var convert_list = [

    ["死", "√16"],
    ["殺", "杀殳"],
    ["切", "七刀"],
    ["刺", "Stub"],
    ["障害者", "生涯斜"],
    ["障害", "SHOW GUY"],
    ["ガイジ", "GUY児"],
    ["害", "GUY"],
    ["手帳", "📘"],
    ["カスが", "春日"],
    ["カス", "春"],
    ["ゴミ", "誤未"],
    ["凍結", "10結"],
    ["馬鹿", "ｳﾏｼｶ"],
    ["キチガイ", "キチゲェ"],
    ["きちがい", "きちGUY"],
    ["ブサイク", "顔面慎め案件"],
    ["変態", "姿慎め案件"],
    ["統合失調症", "糖質"],
    ["キチゲェ", "糖度高い"],
    ["クズ", "久豆"],
    ["ボケ", "木瓜"],
    ["知恵遅れ", "知恵Slow"],
    ["罪", "Climb"],

    //その他、一部悪ポテト構文
    ["いも", "ポテト"],
    ["否", "ノー"],
    ["たが、", "たBut."],
    ["あった", "Aった"],

    //riosi教表現
    ["ご苦労さん", "5963"],
    ["書く", "格"],
    ["陰キャ", "根暗"],
    ["レスバ", "論争"],
    ["レスバトル", "論争"],

    //姫語録
    ["俺様", "お姫様"],
    ["ワイ", "Y"],
    ["男", "Y"],
    ["私", "MySelf"],
    ["ふざけるな", "弁えろ"],
    ["調子乗るな", "慎め"],
    ["謝罪しろ", "ケジメつけろ"],
    ["生声", "玉音"],
    ["申請", "神聖"],
    ["行く", "イく"],
    ["行っ", "イっ"],
    ["トランス", "Tの者"],
    ["イーロン", "E論"],
    ["運ゲー", "ゲー無"],
    ["ヒメコースト", "悪意通報"],
    ["雑魚", "三下"],
    ["ビビる", "チキる"],
    ["びびる", "チキる"],
    ["ビビっ", "チキっ"],
    ["びびっ", "チキっ"],
    ["雑魚共", "烏合"],
    ["ザコ共", "烏合"],
    ["使えん", "無能"],
    ["ゴミども", "烏合之衆"],
    ["無価値", "無益"],
    ["くだらん", "しょーもな"],
    ["意味が無い","無駄"],
    ["打つ","鬱"],
    ["ゴミ味方","ゴ味方"],
    ["植物","草ども"],
    ["からかう","煽る"],
    ["自陣塗り","塗り絵"],
    ["ﾌｰﾝ","（ ´_ゝ`）ﾌｰﾝ"],
    ["ふーん","（ ´_ゝ`）ﾌｰﾝ"],
    ["フーン","（ ´_ゝ`）ﾌｰﾝ"],

    //煽り
    ["考察", "†考察†"],
    ["感想", "お気持ち"],
    ["お気持ち", "†感想†"],

    //方言
    ["だから", "やけん"],
    ["イキ", "しゃしゃ"],
    ["ので", "けん"],
    ["です", "けんの"],

    //番号
    ["野獣", "810"],
    ["オナニー", "0721"],
    ["臭い", "931"],
    ["見ろよ", "367"],
    ["見ろ", "36"],

    //ルー大柴
    ["日", "Day"],
    ["言う", "Say"],
    ["話す", "Say"],

    //文字数短縮
    ["ラック", "LUCK"],
    ["いる", "ILL"],
    ["しっく", "Sick"],
    ["せい", "Say"],
    ["しょう", "Show"],
    ["ロック", "†ROCK†"],

    //その他隠語
    ["Lite", "軽"],
    ["lite", "軽"],
    ["命", "Life"],
    ["ストゼロ", "9%0"],
    ["ストドラ", "9%dry"],

    //機械解析妨害
    //https://se130054.jimdofree.com/%E3%82%AB%E3%82%BF%E3%82%AB%E3%83%8A%E3%81%A3%E3%81%BD%E3%81%84%E6%BC%A2%E5%AD%97/
    ["一","ー"],
    ["カ","力"],
    ["力","カ"],
    ["タ","夕"],
    ["夕","タ"],
    ["エ","工"],
    ["工","エ"],
    ["ク","𠂊"],
    ["𠂊","ク"],
    ["テ","亍"],
    //["亍","テ"],
    ["ト","卜"],
    ["卜","ト"],
    ["ナ","𠂇"],
    ["𠂇","ナ"]
];

function karitxt_korosu() {

    const ta = document.getElementById("origin_text_area");
    var t =
        `死ね障害者。殺すぞカス。手帳持ちのゴミはさっさと死ね。首切り落としてやろうか。ブサイク。変態。弟の厚史は当職が殺害しました`;
    ta.value = t;

    const ota = document.getElementById("origin_text_count");
    ota.innerText = `表現の自由　文字数:${t.length}`
}


function karitxt_otouto_killer() {

    const ta = document.getElementById("origin_text_area");
    var t =
        `当職の弟を当職が殺したなどという当職のアイデンティティを否定する投稿が多数なされておりました。
当職の弟は厚史という名前でした。
一つ違いの弟でした。喧嘩もしましたが、私にとってのかけがいのない弟でした。
弟は、地元の悪いもの達に、恐喝され、多摩川の河川敷で、集団暴行にあった翌日に親にもいえず自殺しました。
弟が16、私が17のことでした。私の中にはいつも弟がいます。`
        ;
    ta.value = t;

    const ota = document.getElementById("origin_text_count");
    ota.innerText = `表現の自由　文字数:${t.length}`
}

function initialize() {
    //仮

}

function changeText() {
    var ta = document.getElementById("origin_text_area");
    var text = ta.value;

    convert_list.forEach(item => {
        const regex = new RegExp(item[0], 'g'); // 変数 apple を使って正規表現を作成
        text = text.replace(regex, item[1]);
    });


    const ota = document.getElementById("change_text_count");
    ota.innerText = `表現の不自由　文字数:${text.length}`
    document.getElementById("change_text_area").value = text;
}

initialize();